merge
on
many to one
many to many default hiç değişken atlmaz grekirse defalarca yazar

In [1]:
import pandas as pd

In [10]:
df1=pd.DataFrame({"workers":["hasan","ali","ayse",],
                    "department":["ce","ee","acc"]})
df1

  workers department
0   hasan         ce
1     ali         ee
2    ayse        acc

In [6]:
df2=pd.DataFrame({"teamLead":["leyal","yaren","erdal"],
                    "department":["ce","acc","ee"]})
df2

  teamLead department
0    leyal         ce
1    yaren        acc
2    erdal         ee

In [7]:
pd.merge(df1,df2) #görüldüğü üzere merge akıllı birleştirme yapar. 
#bakın değikenler göre birleştime yaptı kendisi uygun ortak değişkenlere göre birleştirdi

  workers department teamLead
0   hasan         ce    leyal
1     ali         ee    erdal
2    ayse        acc    yaren

Bund asayıları aynıydı peki ya değişkenlerin sayıları aynı olmasaydı

?değişken sayısı daha fazla yada daha az olursa?

?değişkenler farklı olursa ?

In [27]:
#mesala bir tan efazla lead olsaydı
df2=pd.DataFrame({"teamLead":["leyal","yaren","erdal","tomris"],
                    "department":["ce","acc","ee","ce"]})
df2

  teamLead department
0    leyal         ce
1    yaren        acc
2    erdal         ee
3   tomris         ce

In [30]:
pd.merge(df1,df2) #görüldüğü üzere o zaman worker değişkenşmşzi ikşi kez yazdık many to one dönüşüm oluyor
#baktı ki iki değişken var ancak bu sınıfta diğer farame de bir tane değişken var. o zaman çok olanı atlamamk için az olan dan iki kez yazıyor

  workers department teamLead
0   hasan         ce    leyal
1   hasan         ce   tomris
2  mecnun         ce    leyal
3  mecnun         ce   tomris
4     ali         ee    erdal
5    ayse        acc    yaren

In [13]:
#bir tane daha çoklu değişken orneği yapalım bu sefer iki tane cp değişkeni iki tane team lead olsun
df1=pd.DataFrame({"workers":["hasan","ali","ayse","mecnun"],
                    "department":["ce","ee","acc","ce"]})
df1

  workers department
0   hasan         ce
1     ali         ee
2    ayse        acc
3  mecnun         ce

In [28]:
# many to many
pd.merge(df1,df2)#he ilki team lead için her iki çalışan da yazıldı. yani gerekirse tekrar yazıyor ancak değişken atlamıyor.

  workers department teamLead
0   hasan         ce    leyal
1   hasan         ce   tomris
2  mecnun         ce    leyal
3  mecnun         ce   tomris
4     ali         ee    erdal
5    ayse        acc    yaren

In [34]:
pd.merge(df1,df2,validate:"many_to_one")

SyntaxError: invalid syntax (423018156.py, line 1)

In [55]:
# birden fazla ortek varsa bunlardan hangisine göre birleştireceğimizi seçebiliriz.
dfA=pd.DataFrame({"name":["derya","elif","kezban"],
        "age":[12,34,23],
        "homeTown":["ankara","manisa","yozgat"]})
dfB=pd.DataFrame({"name":["derya","elif","kemal"],
                    "age":[45,12,23],
                    "caracter":["good","unknown","bad"]})
pd.merge(dfA,dfB, on="name")

    name  age_x homeTown  age_y caracter
0  derya     12   ankara     45     good
1   elif     34   manisa     12  unknown

In [29]:

#! ortak omayam değişken muhabbeti 
#peki ya istediğimize birleştirebilirmiyis?
pd.merge(df1,df2, on="department")

  workers department teamLead
0   hasan         ce    leyal
1   hasan         ce   tomris
2  mecnun         ce    leyal
3  mecnun         ce   tomris
4     ali         ee    erdal
5    ayse        acc    yaren